uhnp/src/Catalogs/ИсходящиеСообщения/ИсходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсходящиеСообщения</name>
  <comment>Выполнение задач № 000035594</comment>
  <attributes>
    <name>ДатаВремяСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УниверсальнаяДатаСобытияВМиллисекундах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СерверОчередей</name>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлючСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Доставлено</name>
    <comment>// Казачкин Дмитрий 15.10.2020 Выполнение задач №000036151</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>// Казачкин Дмитрий 15.10.2020 Выполнение задач №000036151</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторнойОтправки</name>
    <comment>// Казачкин Дмитрий 15.10.2020 Выполнение задач №000036151</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УзелПланаОбмена</name>
    <comment>//Ведутенко С.А. от 15.08.2025 Выполнение задач №000054799</comment>
    <type>
      <types>ExchangePlanRef.тн_Интеграция_УПП_ЦБ</types>
      <types>ExchangePlanRef.тн_Интеграция_УПП</types>
      <types>ExchangePlanRef.тн_Интеграция_УПП_ОКС</types>
      <types>ExchangePlanRef.тн_Интеграция_ЗУП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <comment>// Луконин Е.А. 01.09.2025 Выполнение задач №000054975</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВремяПопыткиОтправки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокДоставки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПовторнойДоставки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/тн_Интеграция_НастройкиПовторнойОтправки/тн_Интеграция_НастройкиПовторнойОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_Интеграция_НастройкиПовторнойОтправки</name>
  <comment>// Казачкин Дмитрий 15.10.2020 Выполнение задач №000036151</comment>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПовторнойОтправки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопытокДоставки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИнтервалПовторнойДоставки</name>
    <comment>// Тулинов Владимир 18.02.2026 Выполнение задач №000056806</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.тн_ВидыСообщенийPortal</types>
      <types>EnumRef.тн_ВидыСообщений_ERP_УХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ИсходящиеСообщения/ManagerModule.bsl
// Устарела. Следует использовать новую (см. Справочники.ИсходящиеСообщения.Отправить)
// 
// Публикация сообщения во внутренней очереди
//
Процедура Опубликовать(Знач КлючМаршрутизации,
					   Знач Сообщение,
					   Знач ДатаСобытия = '00010101',
					   Знач ТочкаПубликации = "api.onec",
					   Знач СерверОчередей = "") Экспорт

	Объект = СоздатьЭлемент();
	Объект.ТочкаПубликации   = ТочкаПубликации;
	Объект.КлючМаршрутизации = КлючМаршрутизации;
	Объект.ДатаВремяСобытия  = ДатаСобытия;
	Объект.Сообщение         = Сообщение;
	
	Если Не ЗначениеЗаполнено(СерверОчередей) Тогда
		СерверОчередей = Справочники.СерверыОчередейRMQ.Основной;
	ИначеЕсли ТипЗнч(СерверОчередей) = Тип("Строка") Тогда
		// Временное приведение типов для мягкой миграции 1.3 -> 1.4
		СерверОчередей = Справочники.СерверыОчередейRMQ.ПолучитьПараметрыСервера(СерверОчередей).Ссылка;
	КонецЕсли;
	
	Объект.СерверОчередей = СерверОчередей;
	
	// Вычисление универсальной даты события для переходящих с API 1.3
	УниверсальноеДатаСобытия = УниверсальноеВремя(Объект.ДатаВремяСобытия);
	ЧислоСекунд = УниверсальноеВремя(УниверсальноеДатаСобытия);
	Объект.УниверсальнаяДатаСобытияВМиллисекундах = ЧислоСекунд * 1000;
	
	Объект.Записать();

КонецПроцедуры // Опубликовать()

// Борисенко И.Н. 07.05.2021 Выполнение задачи №000035594
// Поместить сообщение в очередь отложенной отправки сообщений.
//
// Параметры:
//  Сообщение						 - Строка - Тело сообщения 
//  ТочкаПубликации					 - Строка - Точка публикации
//		(необязательно) Значение по умолчанию - ""
//  КлючМаршрутизации				 - Строка - Ключ маршрутизации
//		(необязательно) Значение по умолчанию - ""
//  СерверОчередей					 - СправочникСсылка.СерверыОчередейRMQ - Ссылка на настройки подключения к серверу очередей.
//                                     Если не заполнено, отправка осуществляется в "Основной" сервер очередей.
//		(необязательно) Значение по умолчанию - Неопределено
//  СвойстваСообщения				 - Структура - Свойства сообщения. Названия ключей соответствия доступны в методе
//                                     ОчередьСообщений.ВозможныеСвойстваСообщения
//		(необязательно) Значение по умолчанию - Неопределено
//  УниверсальнаяДатаВремяСобытия	 - Число - Универсальная дата и время события в миллисекундах. Если не заполнено,
//                                     заполняется текущей датой.
//		(необязательно) Значение по умолчанию - 0
//
Процедура Отправить(Знач Сообщение,
					Знач ТочкаПубликации = "",
					Знач КлючМаршрутизации = "",
					Знач СерверОчередей = Неопределено,
					Знач СвойстваСообщения = Неопределено,
					Знач ВидСообщения = Неопределено,                // Борисенко Игорь 18.05.2021 Выполнение задач №000037903
					Знач УниверсальнаяДатаВремяСобытия = 0) Экспорт
					
	Объект = Неопределено;				
	Сс = ПолучитьСсылку(СвойстваСообщения.УИД);
	Если Сс <> Неопределено Тогда
		Объект = Сс.ПолучитьОбъект();
	КонецЕсли;
	Если Объект = Неопределено Тогда
		
		Объект = СоздатьЭлемент();
		
		Если ТипЗнч(СвойстваСообщения) = Тип("Структура") И СвойстваСообщения.Свойство("УИД") И ЗначениеЗаполнено(СвойстваСообщения.УИД) Тогда
			Объект.УстановитьСсылкуНового(ПолучитьСсылку(СвойстваСообщения.УИД));
		КонецЕсли;
		
	КонецЕсли;
	Если ТипЗнч(СвойстваСообщения) = Тип("Структура") И СвойстваСообщения.Свойство("УИД") И ЗначениеЗаполнено(СвойстваСообщения.УИД) Тогда
		СвойстваСообщения.Удалить("УИД");
	КонецЕсли;
	
	// НАЧАЛО Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	Если ТипЗнч(СвойстваСообщения) = Тип("Структура") Тогда
		
		//НАЧАЛО Ведутенко С.А. 02.09.2025 Выполнение задач №000054799
		Если СвойстваСообщения.Свойство("СтруктураРеквизитовИсходящегоСообщения") Тогда 
			ЗаполнитьЗначенияСвойств(Объект, СвойстваСообщения.СтруктураРеквизитовИсходящегоСообщения);
			СвойстваСообщения.Удалить("СтруктураРеквизитовИсходящегоСообщения");
		КонецЕсли;    
		//КОНЕЦ  Ведутенко С.А. 02.09.2025 Выполнение задач №000054799

		Если СвойстваСообщения.Свойство("Type") Тогда				
			Объект.ТипСообщения = СвойстваСообщения.Type;
			РегистрыСведений.ТН_Интеграция_ПриоритетыОбработкиСообщенийRMQ.ДобавитьТипЗапроса(СвойстваСообщения.Type, Истина);
		КонецЕсли;
		
		// НАЧАЛО Шкапов В.А. 21.01.2026 Выполнение задач №000056484
		Если СвойстваСообщения.Свойство("AppId") Тогда
			СвойстваСообщения.AppId = КлючОтправителя();
		Иначе
			СвойстваСообщения.Вставить("AppId", КлючОтправителя()); 	
		КонецЕсли;
		// КОНЕЦ Шкапов В.А. 21.01.2026 Выполнение задач №000056484
		
	КонецЕсли;
	// КОНЕЦ Луконин Е.А. 01.09.2025 Выполнение задач №000054975
	
	// НАЧАЛО Шкапов В.А. 21.01.2026 Выполнение задач №000056484
	Если СвойстваСообщения = Неопределено Тогда
		СвойстваСообщения = Новый Структура;
		СвойстваСообщения.Вставить("AppId", КлючОтправителя());
	КонецЕсли;
	// КОНЕЦ Шкапов В.А. 21.01.2026 Выполнение задач №000056484
	
	Объект.ТочкаПубликации   = ТочкаПубликации;
	Объект.КлючМаршрутизации = КлючМаршрутизации;
	Объект.УниверсальнаяДатаСобытияВМиллисекундах = УниверсальнаяДатаВремяСобытия;
	Объект.Сообщение         = Сообщение;
	Объект.СерверОчередей    = СерверОчередей;
			
// НАЧАЛО Борисенко Игорь 18.05.2021 Выполнение задач №000037903
	Если ЗначениеЗаполнено(ВидСообщения) Тогда
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тн_Интеграция_НастройкиПовторнойОтправки.КоличествоПопыток КАК КоличествоПопыток,
		// НАЧАЛО Тулинов Владимир 18.02.2026 Выполнение задач №000056806
		|	ТН_Интеграция_НастройкиПовторнойОтправки.КоличествоПопытокДоставки КАК КоличествоПопытокДоставки,
		|	ТН_Интеграция_НастройкиПовторнойОтправки.ИнтервалПовторнойДоставки КАК ИнтервалПовторнойДоставки,
		// КОНЕЦ Тулинов Владимир 18.02.2026 Выполнение задач №000056806
		|	тн_Интеграция_НастройкиПовторнойОтправки.ИнтервалПовторнойОтправки КАК ИнтервалПовторнойОтправки
		|ИЗ
		|	РегистрСведений.тн_Интеграция_НастройкиПовторнойОтправки КАК тн_Интеграция_НастройкиПовторнойОтправки
		|ГДЕ
		|	тн_Интеграция_НастройкиПовторнойОтправки.ВидСообщения = &ВидСообщения";
		
		Запрос.УстановитьПараметр("ВидСообщения", ВидСообщения);
		
		Выборка = Запрос.Выполнить().Выбрать();				
		
		Если Выборка.Следующий() Тогда
			
			Объект.КоличествоПопыток = Выборка.КоличествоПопыток;
			Объект.ИнтервалПовторнойОтправки = Выборка.ИнтервалПовторнойОтправки;
			
			// НАЧАЛО Тулинов Владимир 18.02.2026 Выполнение задач №000056806
			Объект.КоличествоПопытокДоставки = Выборка.КоличествоПопытокДоставки;
			Объект.ИнтервалПовторнойДоставки = Выборка.ИнтервалПовторнойДоставки;
			// КОНЕЦ Тулинов Владимир 18.02.2026 Выполнение задач №000056806
			
		КонецЕсли;
		
	КонецЕсли;
// КОНЕЦ  Борисенко Игорь 18.05.2021 Выполнение задач №000037903	
	
	// НАЧАЛО Тулинов Владимир 18.02.2026 Выполнение задач №000056806
	Объект.КоличествоПопыток		 = Объект.КоличествоПопыток + 1;
	// КОНЕЦ Тулинов Владимир 18.02.2026 Выполнение задач №000056806
	
	Если СвойстваСообщения <> Неопределено Тогда
		Объект.СвойстваСообщения = ЗначениеВСтрокуВнутр(СвойстваСообщения);
	КонецЕсли;	
	
	Объект.Записать();
					
КонецПроцедуры // Отправить()

// Шкапов В.А. 21.01.2026 Выполнение задач №000056484
//
Функция КлючОтправителя()
	
	ПроизводственноеПодразделение = Константы.тн_ПроизводственноеПодразделение.Получить();
	
	Возврат XMLСтрока(ПроизводственноеПодразделение);
	
КонецФункции
